In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns

In [2]:
df=pd.read_csv('./Car_Purchasing_Data.csv',encoding='ISO-8859-1')

In [3]:
df

,Customer Name,Customer e-mail,Country,Gender,Age,Annual Salary,Credit Card Debt,Net Worth,Car Purchase Amount
0,Martina Avila,cubilia.Curae.Phasellus@quisaccumsanconvallis.edu,Bulgaria,0,41.851720,62812.09301,11609.380910,238961.2505,35321.45877
1,Harlan Barnes,eu.dolor@diam.co.uk,Belize,0,40.870623,66646.89292,9572.957136,530973.9078,45115.52566
2,Naomi Rodriquez,vulputate.mauris.sagittis@ametconsectetueradip...,Algeria,1,43.152897,53798.55112,11160.355060,638467.1773,42925.70921
3,Jade Cunningham,malesuada@dignissim.com,Cook Islands,1,58.271369,79370.03798,14426.164850,548599.0524,67422.36313
4,Cedric Leach,felis.ullamcorper.viverra@egetmollislectus.net,Brazil,1,57.313749,59729.15130,5358.712177,560304.0671,55915.46248
...,...,...,...,...,...,...,...,...,...
495,Walter,ligula@Cumsociis.ca,Nepal,0,41.462515,71942.40291,6995.902524,541670.1016,48901.44342
496,Vanna,Cum.sociis.natoque@Sedmolestie.edu,Zimbabwe,1,37.642000,56039.49793,12301.456790,360419.0988,31491.41457
497,Pearl,penatibus.et@massanonante.com,Philippines,1,53.943497,68888.77805,10611.606860,764531.3203,64147.28888
498,Nell,Quisque.varius@arcuVivamussit.net,Botswana,1,59.160509,49811.99062,14013.034510,337826.6382,45442.15353
499,Marla,Camaron.marla@hotmail.com,marlal,1,46.731152,61370.67766,9391.341628,462946.4924,45107.22566

In [4]:
df.head()

,Customer Name,Customer e-mail,Country,Gender,Age,Annual Salary,Credit Card Debt,Net Worth,Car Purchase Amount
0,Martina Avila,cubilia.Curae.Phasellus@quisaccumsanconvallis.edu,Bulgaria,0,41.851720,62812.09301,11609.380910,238961.2505,35321.45877
1,Harlan Barnes,eu.dolor@diam.co.uk,Belize,0,40.870623,66646.89292,9572.957136,530973.9078,45115.52566
2,Naomi Rodriquez,vulputate.mauris.sagittis@ametconsectetueradip...,Algeria,1,43.152897,53798.55112,11160.355060,638467.1773,42925.70921
3,Jade Cunningham,malesuada@dignissim.com,Cook Islands,1,58.271369,79370.03798,14426.164850,548599.0524,67422.36313
4,Cedric Leach,felis.ullamcorper.viverra@egetmollislectus.net,Brazil,1,57.313749,59729.15130,5358.712177,560304.0671,55915.46248

## Finding null values

In [5]:
df.isnull().sum()

Customer Name          0
Customer e-mail        0
Country                0
Gender                 0
Age                    0
Annual Salary          0
Credit Card Debt       0
Net Worth              0
Car Purchase Amount    0
dtype: int64

In [6]:
df=df.drop(['Customer Name','Customer e-mail','Country'],axis=1)

In [7]:
df.head()

,Gender,Age,Annual Salary,Credit Card Debt,Net Worth,Car Purchase Amount
0,0,41.851720,62812.09301,11609.380910,238961.2505,35321.45877
1,0,40.870623,66646.89292,9572.957136,530973.9078,45115.52566
2,1,43.152897,53798.55112,11160.355060,638467.1773,42925.70921
3,1,58.271369,79370.03798,14426.164850,548599.0524,67422.36313
4,1,57.313749,59729.15130,5358.712177,560304.0671,55915.46248

## Checking the information

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Gender               500 non-null    int64
 1   Age                  500 non-null    float64
 2   Annual Salary        500 non-null    float64
 3   Credit Card Debt     500 non-null    float64
 4   Net Worth            500 non-null    float64
 5   Car Purchase Amount  500 non-null    float64
dtypes: float64(5), int64(1)
memory usage: 23.6 KB

## Checking shape of df

In [9]:
df.shape

(500, 6)

In [10]:
x=df.drop(['Car Purchase Amount'],axis=1)
y=df['Car Purchase Amount']

In [11]:
x.head()

   Gender        Age  Annual Salary  Credit Card Debt    Net Worth
0       0  41.851720    62812.09301      11609.380910  238961.2505
1       0  40.870623    66646.89292       9572.957136  530973.9078
2       1  43.152897    53798.55112      11160.355060  638467.1773
3       1  58.271369    79370.03798      14426.164850  548599.0524
4       1  57.313749    59729.15130       5358.712177  560304.0671

In [12]:
y.head()

0    35321.45877
1    45115.52566
2    42925.70921
3    67422.36313
4    55915.46248
Name: Car Purchase Amount, dtype: float64

## Dividing the Data into train and test manner

In [13]:
from sklearn.model_selection import train_test_split

In [14]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.33, random_state=42)

In [15]:
x_train.shape

(335, 5)

In [16]:
x_train

     Gender        Age  Annual Salary  Credit Card Debt    Net Worth
471       0  43.542528    65364.06334       7839.414396  579640.7982
26        0  28.009676    82842.53385      13102.158050  315775.3207
7         1  50.193016    51752.23445      10985.696560  629312.4041
453       0  25.179893    45092.74073      11380.092880  158758.3577
108       1  30.349459    61922.89710      10366.503260  323453.2022
..      ...        ...            ...               ...          ...
106       0  41.796014    51075.46118      12416.848450  450402.2932
270       0  35.375156    33422.99683       8570.611562  211168.6293
348       0  45.305941    63561.04525       3730.119720  608019.6308
435       1  57.974293    41409.29390       8211.340920  421318.9764
102       1  30.492353    68289.18229       7357.787011  404457.3099

[335 rows x 5 columns]

In [17]:
y_train

471    48052.65091
26     37161.55393
7      47434.98265
453     9000.00000
108    27586.71854
          ...
106    34803.82395
270    12536.93842
348    49348.88394
435    42139.64528
102    33640.73697
Name: Car Purchase Amount, Length: 335, dtype: float64

In [18]:
x_test.shape

(165, 5)

In [19]:
x_test

     Gender        Age  Annual Salary  Credit Card Debt    Net Worth
361       0  36.126918    74420.10254      10274.135580  551344.3365
73        1  47.789729    59139.21080       4630.544424  473845.8546
374       1  57.134576    67752.38329      13851.921220  657178.4135
155       0  50.219573    55381.53225       5088.239017   20000.0000
104       0  48.476396    63975.06090      10614.854490  891439.8761
..      ...        ...            ...               ...          ...
110       1  46.071727    73476.42249       9656.806156  386287.0208
318       1  39.604810    70381.37499       6718.857016  305253.2658
428       0  42.640666    56687.93949      10827.161400  790116.4252
29        1  40.245327    62891.86556      12522.940520  583230.9760
437       0  51.525327    48746.71666       3923.407178  217188.4056

[165 rows x 5 columns]

## Multiple linear regression

In [20]:
from sklearn.linear_model import LinearRegression

In [21]:
reg=LinearRegression()

In [22]:
reg.fit(x_train,y_train)

LinearRegression()

In [23]:
reg.coef_

array([-5.69156670e-02,  8.41566650e+02,  5.62334493e-01, -2.75998204e-05,
        2.89836706e-02])

In [24]:
reg.intercept_

-42147.38868681443

## checking training data performance

In [25]:
y_train_pred=reg.predict(x_train)

In [26]:
from sklearn.metrics import r2_score

In [27]:
r2_score(y_train,y_train_pred)*100

99.99999814474464

## Test accuracy

In [28]:
y_test_pred=reg.predict(x_test)

In [29]:
r2_score(y_test,y_test_pred)

0.9999999802520281

In [30]:
r2_score(y_test,y_test_pred)*100

99.99999802520281

In [31]:
Actual_data=pd.DataFrame({'Actual':y_train,'Predictions':y_train_pred})
Actual_data

          Actual   Predictions
471  48052.65091  48052.919967
26   37161.55393  37161.800647
7    47434.98265  47434.869677
453   9000.00000   9001.459109
108  27586.71854  27589.602653
..           ...           ...
106  34803.82395  34802.205046
270  12536.93842  12538.272659
348  49348.88394  49345.686527
435  42139.64528  42138.804062
102  33640.73697  33637.719177

[335 rows x 2 columns]

In [32]:
x_train.columns

Index(['Gender', 'Age', 'Annual Salary', 'Credit Card Debt', 'Net Worth'], dtype='object')

In [33]:
reg.predict([[0,25,500.1,1,1000]])

C:\Users\vishwateja\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([-20798.01530322])

In [34]:
# model saving:

import pickle

In [40]:
with open('./regression project/car_price.pkl' , 'wb') as f:
    pickle.dump(reg , f)

In [41]:
# load and predict:

model = pickle.load(open('./regression project/car_price.pkl' , 'rb'))

In [43]:
model.predict([[0,25,500.1,1,1000]])[0]

C:\Users\vishwateja\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

-20798.015303223954